app/controllers/tags_controller.rb

	def destroy
		@tag = Tag.find(params[:id])
		tag_name = @tag.name
		@tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]